// ********************************************************
// example1.cpp
// 功能：说明指针变量的定义，以及操作符*和&的含义和运用
// ********************************************************
#include <iostream>
using namespace std;
int main()
{
    int a;	// 定义整型变量a
    float b;	// 定义float型变量b
    int* p1;	// ①定义指向整型变量的指针变量p1
    float* p2;	// ②定义指向float型变量的指针变量p2
    a = 100;	// ③
    b = 3.1;	// ④
    p1 = &a;	// ⑤利用&取得变量a的地址，将此地址赋值给p1
    p2 = &b;	// ⑥利用&取得变量b的地址，将此地址赋值给p2
    cout << a << "     " << b << endl;	// ⑦
    cout << *p1 << "     " << *p2 << endl;	// ⑧
    cout << *&a << "     " << *&b << endl;	// ⑨
    return 0;
}
